Revit 2027 API
IExternalService.GetName Method
 Implement this method to return the name of the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetName()
Function GetName As String
String^ GetName()
abstract GetName : unit -> string
Return Value
String
 Name of the service.
Remarks
Although an external service is uniquely identified by its Id, the Name can identify it to the end user in UI when UI is appropriate for the service.
Beside the requirement for the name to be a non-empty string, there are no other general restrictions imposed by the External Services Framework.
See Also
Reference
IExternalService Interface
Autodesk.Revit.DB.ExternalService Namespace